<div id="main_area">
    <div class="post">
    <h1 align="center">SPORTS</h1>
    <h2>CRICKET</h2>
    <img src="<?php echo URL."views/spage/img/sports/";?>cricket.jpg" width="700px">
    <h3>Master in charge</h3>
    <p>
    <ul>
    <li>school team - Mr.Aruna Liyanage</li>
<li>under 17 - Mr.Kalum Arunashantha</li>
<li>Under 15 - Mr.Yasas Sri Hidalla arachchi</li>
<li>Under 13 - Mr.Nadun Liyanage</li>
<li>Head of Coaching - Mr.Eranga Gunarathna</li>
</ul>
<h5>Coaches -</h5> 
<ul>
<li>Mr. Amil Senadeera</li>
<li>Mr.Harshana Pramod</li>
<li>Mr.Sudesh Harsha</li>
</ul>
<h3>Big Match with Taxila vidyalaya horana</h3> </p>
<br/>
<h2>RUGBY</h2>
<br/>
<img src="<?php echo URL."views/spage/img/sports/";?>rugby1.jpg" width="350px">
<img src="<?php echo URL."views/spage/img/sports/";?>rugby2.jpg" width="350px">
<br/>
<p>පිළියන්දල මධ්‍ය විද්‍යාලයේ දැනට ක්‍රියාත්මක වන ක්‍රීඩා ඉසව් අතරින් රගර් ක්‍රිඩාවට ප්‍රධාන ස්ථානයක් හිමිවේ.රගර් ක්‍රීඩාවෙන් පසුගිය වසර කිහිපය තුල පාසල් මට්ටමේ ජයග්‍රහන රැසක් හිමිකර ගැනීමට සමත්ව තිබේ. වර්තමාන රගර් ක්‍රීඩා ඉසව් බාර  රමණි මල්ලවරාච්චි මහත්මිය සම්බන්ඳවීමත්, හසන්ත ලියනගේ මහතා පාසලේ රගර්  පුහුණුකරු ධූරයට පත්වීමත් සමඟ පිළියන්දල  මධ්‍ය විද්‍යාලය තුල රගර් ක්‍රීඩාව ප්‍රගතියක් ලබමින් ඉදිරියට පැමිණ ඇත. 2018 වසරේ cකාන්ඩයේ රැඳී සිටි පිළියන්දල මධ්‍ය විද්‍යාලය 2019 වසරේ B කාන්ඩය දක්වා උසස්කොට ඇත. 2019 තරඟවාරයේදී පන්නිපිටිය ධර්මපාල විද්‍යාලය(65,0), වයඹ රාජකීය විද්‍යාලට (49,3),මොරටු මහා විද්‍යාලය(63,0), කුරුණෑගල ශාන්ත ආනා විද්‍යාලය(47/7), නුගේගොඩ ශාන්ත ජෝන් විද්‍යාලය(43,12)  ලෙස පරාජයට පත් කරමින් රග්බි තරඟාවලියේ ඉදිරියට පැමිනීමට සමත්ව ඇත. 
රග්බි කන්ඩායමේ නායකත්වය ජනිත් පවිත්‍ර හොබවන අතර, උපනායකයා ලෙස තිළිණ සඳරුවන් කටයුතු කරන ලදි. අනෙකුත් ක්‍රීඩකයන් වන්නේ බන්ඩාර වීරසූරිය,සංජන විමුක්තී,භාණුක උඩවත්තත, එස්.පී.ලොකුගේ, හංසක ධනංජය, සහන් දර්ශන, ඩී.එන්.ජී.ලියනගේ, පසන් කළුපහන, යසස් බුදිධික, ජනිදූ දිල්ෂාන්, සජාන් බිම්සට, හරිත ගිහාන්, චමිඳු හිරුෂාන්, පසිඳු මාධව, ලහිරු ලක්ෂාන්, කවිඳු ක්‍රිශාන්, තරුෂ දැකූම්, අනුරාධ යසස් ශ්‍රී, කවිඳූ ලක්ෂාන්, එම්.ටී.ජී. මලලනායක.  </p>

